misc/artillery/proxy/load.yml
config:
    target: "ws://localhost:8000/connection/websocket"
    phases:
      - duration: 60
        arrivalRate: 10
        name: "Proxy test scenario: connect, rpc, possibly refresh"
scenarios:
    - engine: "ws"
      flow:
        - send: '{"id":1}'
        - think: 2
        - send: '{"id":2,"method":"rpc","params":{"data":{"message":"hello 1"}}}'
        - think: 1
        - send: '{"id":3,"method":"rpc","params":{"data":{"message":"hello 2"}}}'
        - think: 1
        - send: '{"id":4,"method":"rpc","params":{"data":{"message":"hello 3"}}}'
        - think: 1
        - send: '{"id":5,"method":"rpc","params":{"data":{"message":"hello 4"}}}'
        - think: 1
        - send: '{"id":6,"method":"rpc","params":{"data":{"message":"hello 5"}}}'
        - think: 14